// Напиши скрипт, який об'єднує всі елементи массива в один рядок. Елементів може бути довільна кількість. Нехай елементи массива в рядку будут розділені комою.
const friends = ['Mango' , 'Poly' , 'Kiwi' , 'Ajax'];
const string = friends.join(" , ");
console.log(string);

// Працюємо з колекцією карток в trello. Метод splice() (можна використати інші методи)
const cards = [
    'Карточка-1',
    'Карточка-2',
    'Карточка-3',
    'Карточка-4',
    'Карточка-5',
    'Карточка-6',
]
// Видалити 3 карточку
cards.splice(2, 1);

// додати 7 карточку
cards.push('Карточка-7');

// oновити 4 карточку
cards[2] = 'Нова карточка-4'
console.log(cards);